// @strict-types


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ШифрованныйТекст = Параметры.ШифрованныйТекст;
	
	Попытка
		ДвоичныеДанныеТекста = Base64Значение(ШифрованныйТекст);
		ДешифрованныйТекст = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеТекста);
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Не удалось декодировать выделенный текст");
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
