// @strict-types


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ШифрованныйТекст = Параметры.ШифрованныйТекст;
	
	Попытка
		
		ДвоичныеДанныеТекста = Base64Значение(ШифрованныйТекст);
		ДешифрованныйТекст = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеТекста);
		
	Исключение
		
		ОбщегоНазначения.СообщитьПользователю("Не удалось декодировать выделенный текст");
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДешифрованныйТекстПриИзменении(Элемент)
	
	ПересчитатьШифрованныйТекст();
	
КонецПроцедуры

&НаКлиенте
Процедура ДешифрованныйТекстИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	
	Если Модифицированность Тогда
		
		ПересчитатьШифрованныйТекст();
		ПараметрыЗакрытия.Вставить("ШифрованныйТекст", ШифрованныйТекст);
		
	КонецЕсли;
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПересчитатьШифрованныйТекст()
	
	ДвоичныеДанныеТекста = ПолучитьДвоичныеДанныеИзСтроки(ДешифрованныйТекст); // ДвоичныеДанные
	ШифрованныйТекст = Base64Строка(ДвоичныеДанныеТекста);
	
КонецПроцедуры

#КонецОбласти