// @strict-types

#Область ПрограммныйИнтерфейс

// Регистрация настроек регламентного задания очистки логов для подсистемы БСП.
//
// Параметры:
//  Настройки - см. РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий
//
&После("ПриОпределенииНастроекРегламентныхЗаданий")
Процедура OneSniffer_ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.OneSniffer_ОчисткаЛоговТрафика;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;
	
КонецПроцедуры

#КонецОбласти
