// @strict-types


#Область ПрограммныйИнтерфейс

// Вызвать HTTPМетод.
// 
// Параметры:
//  Соединение - HTTPСоединение
//  Метод - Строка
//  Запрос - HTTPЗапрос
//  ИмяВыходногоФайла - Строка
//  ИмяСобытия - Строка
// 
// Возвращаемое значение:
//  HTTPОтвет
//
Функция _ВызватьHTTPМетод(Знач Соединение, Знач Метод, Знач Запрос, Знач ИмяВыходногоФайла = "", ИмяСобытия = "") Экспорт
	
	// Если логирование не используется, то делаем ровно то, что было бы сделано без расширения, без перехвата исключений.
	НастройкиЛогирования = ЛогированиеТрафика.ЗагрузитьНастройкиЛогирования();
	Если Не НастройкиЛогирования.ВключеноЛогирование Тогда
		
		Если ПустаяСтрока(ИмяВыходногоФайла) Тогда
			HTTPОтвет = Соединение.ВызватьHTTPМетод(Метод, Запрос); // HTTPОтвет
		Иначе
			HTTPОтвет = Соединение.ВызватьHTTPМетод(Метод, Запрос, ИмяВыходногоФайла); // HTTPОтвет
		КонецЕсли;
		
		Возврат HTTPОтвет;
		
	КонецЕсли;
	
	ПараметрыЛога = Новый Структура;
	ПараметрыЛога.Вставить("Соединение", Соединение);
	ПараметрыЛога.Вставить("HTTPЗапрос", Запрос);
	ПараметрыЛога.Вставить("ИмяМетода", Метод);
	ПараметрыЛога.Вставить("ИмяСобытия", ИмяСобытия);
	ЛогЗапроса = РегистрыСведений.ЛогиТрафика.НовыйЛог(
		Перечисления.НаправлениеHTTPЛога.Исходящий,
		Перечисления.НазначениеЛога.Рабочий,
		ПараметрыЛога);
	ЛогированиеТрафика.ИмяСобытия(ЛогЗапроса.Событие, Запрос.АдресРесурса);
	
	Попытка
		
		Если ПустаяСтрока(ИмяВыходногоФайла) Тогда
			HTTPОтвет = Соединение.ВызватьHTTPМетод(Метод, Запрос); // HTTPОтвет
		Иначе
			HTTPОтвет = Соединение.ВызватьHTTPМетод(Метод, Запрос, ИмяВыходногоФайла); // HTTPОтвет
		КонецЕсли;
		
		ЛогЗапроса.Вставить("HTTPОтвет", HTTPОтвет);
		
	Исключение
		
		// Запишем в лог текст самого исключения.
		Комментарий = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Если НастройкиЛогирования.ЗаписыватьВРСТело Тогда
			ЛогЗапроса.Содержание.ТелоОтвета = Комментарий;
		КонецЕсли;
		
		// Подготовим данные для записи в журнал регистрации.
		ДанныеДляЗаписи = ЛогированиеТрафика.ДанныеДляЗаписиВЖурналРегистрации(ЛогЗапроса);
		
		ЗаписьЖурналаРегистрации(
			ЛогированиеТрафика.СобытиеВызватьHTTPМетод(), 
			УровеньЖурналаРегистрации.Ошибка,, 
			ДанныеДляЗаписи, 
			Комментарий);
		
		Если Не ТранзакцияАктивна() 
			И НастройкиЛогирования.ЗаписыватьВРС Тогда
			
			// Запись лога вне транзакции
			РегистрыСведений.ЛогиТрафика.ЗаписатьЛог(ЛогЗапроса, ИмяВыходногоФайла);
			
		КонецЕсли;
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	Если НастройкиЛогирования.ЗаписыватьВЖР Тогда
		
		ДанныеДляЗаписи = ЛогированиеТрафика.ДанныеДляЗаписиВЖурналРегистрации(ЛогЗапроса);
		КомментарийЖурнала = ЛогированиеТрафика.КомментарийЗаписиЖурналаHTTP(ЛогЗапроса);
		
		ЗаписьЖурналаРегистрации(
			ЛогированиеТрафика.СобытиеВызватьHTTPМетод(), 
			УровеньЖурналаРегистрации.Информация,, 
			ДанныеДляЗаписи, 
			КомментарийЖурнала);
		
	КонецЕсли;
	
	Если НастройкиЛогирования.ЗаписыватьВРС Тогда
		РегистрыСведений.ЛогиТрафика.ЗаписатьЛог(ЛогЗапроса, ИмяВыходногоФайла);
	КонецЕсли;
	
	Возврат ЛогЗапроса.HTTPОтвет;
	
КонецФункции

#КонецОбласти
